[Survived] BlockStatement
src/pages/Auth.jsx:13:34
 export default class Auth extends Component {
   componentDidMount() {
     //animation code
-    $(document).ready(function() {
-      $(".login-info-box").fadeOut();
-      $(".login-show").addClass("show-log-panel");
-
-      $('input[type="radio"]').on("change", function() {
-        if ($("#log-reg-show").is(":checked")) {
-          $(".register-info-box").fadeIn();
-          $(".login-info-box").fadeOut();
-
-          $(".white-panel").removeClass("right-log");
-
-          $(".login-show").addClass("show-log-panel");
-          $(".register-show").removeClass("show-log-panel");
-        }
-        if ($("#log-login-show").is(":checked")) {
-          $(".register-info-box").fadeOut();
-          $(".login-info-box").fadeIn();
-
-          $(".white-panel").addClass("right-log");
-          $(".register-show").addClass("show-log-panel");
-          $(".login-show").removeClass("show-log-panel");
-        }
-      });
-    });
+    $(document).ready(function() {});
   }
 

[Survived] StringLiteral
src/pages/Auth.jsx:14:9
   componentDidMount() {
     //animation code
     $(document).ready(function() {
-      $(".login-info-box").fadeOut();
+      $("").fadeOut();
       $(".login-show").addClass("show-log-panel");
 

[Survived] StringLiteral
src/pages/Auth.jsx:15:33
     //animation code
     $(document).ready(function() {
       $(".login-info-box").fadeOut();
-      $(".login-show").addClass("show-log-panel");
+      $(".login-show").addClass("");
 
       $('input[type="radio"]').on("change", function() {

[Survived] BlockStatement
src/pages/Auth.jsx:17:56
       $(".login-info-box").fadeOut();
       $(".login-show").addClass("show-log-panel");
 
-      $('input[type="radio"]').on("change", function() {
-        if ($("#log-reg-show").is(":checked")) {
-          $(".register-info-box").fadeIn();
-          $(".login-info-box").fadeOut();
-
-          $(".white-panel").removeClass("right-log");
-
-          $(".login-show").addClass("show-log-panel");
-          $(".register-show").removeClass("show-log-panel");
-        }
-        if ($("#log-login-show").is(":checked")) {
-          $(".register-info-box").fadeOut();
-          $(".login-info-box").fadeIn();
-
-          $(".white-panel").addClass("right-log");
-          $(".register-show").addClass("show-log-panel");
-          $(".login-show").removeClass("show-log-panel");
-        }
-      });
+      $('input[type="radio"]').on("change", function() {});
     });
   }

[Survived] ConditionalExpression
src/pages/Auth.jsx:18:13
       $(".login-show").addClass("show-log-panel");
 
       $('input[type="radio"]').on("change", function() {
-        if ($("#log-reg-show").is(":checked")) {
+        if (true) {
           $(".register-info-box").fadeIn();
           $(".login-info-box").fadeOut();

[Survived] BlockStatement
src/pages/Auth.jsx:18:48
       $(".login-show").addClass("show-log-panel");
 
       $('input[type="radio"]').on("change", function() {
-        if ($("#log-reg-show").is(":checked")) {
-          $(".register-info-box").fadeIn();
-          $(".login-info-box").fadeOut();
-
-          $(".white-panel").removeClass("right-log");
-
-          $(".login-show").addClass("show-log-panel");
-          $(".register-show").removeClass("show-log-panel");
-        }
+        if ($("#log-reg-show").is(":checked")) {}
         if ($("#log-login-show").is(":checked")) {
           $(".register-info-box").fadeOut();

[Survived] StringLiteral
src/pages/Auth.jsx:24:13
 
           $(".white-panel").removeClass("right-log");
 
-          $(".login-show").addClass("show-log-panel");
+          $("").addClass("show-log-panel");
           $(".register-show").removeClass("show-log-panel");
         }

[Survived] ConditionalExpression
src/pages/Auth.jsx:27:13
           $(".login-show").addClass("show-log-panel");
           $(".register-show").removeClass("show-log-panel");
         }
-        if ($("#log-login-show").is(":checked")) {
+        if (false) {
           $(".register-info-box").fadeOut();
           $(".login-info-box").fadeIn();

[Survived] BlockStatement
src/pages/Auth.jsx:27:50
           $(".login-show").addClass("show-log-panel");
           $(".register-show").removeClass("show-log-panel");
         }
-        if ($("#log-login-show").is(":checked")) {
-          $(".register-info-box").fadeOut();
-          $(".login-info-box").fadeIn();
-
-          $(".white-panel").addClass("right-log");
-          $(".register-show").addClass("show-log-panel");
-          $(".login-show").removeClass("show-log-panel");
-        }
+        if ($("#log-login-show").is(":checked")) {}
       });
     });

[Survived] StringLiteral
src/pages/Auth.jsx:31:38
           $(".register-info-box").fadeOut();
           $(".login-info-box").fadeIn();
 
-          $(".white-panel").addClass("right-log");
+          $(".white-panel").addClass("");
           $(".register-show").addClass("show-log-panel");
           $(".login-show").removeClass("show-log-panel");

[Survived] StringLiteral
src/pages/Auth.jsx:32:40
           $(".login-info-box").fadeIn();
 
           $(".white-panel").addClass("right-log");
-          $(".register-show").addClass("show-log-panel");
+          $(".register-show").addClass("");
           $(".login-show").removeClass("show-log-panel");
         }

[Survived] StringLiteral
src/pages/Auth.jsx:33:13
 
           $(".white-panel").addClass("right-log");
           $(".register-show").addClass("show-log-panel");
-          $(".login-show").removeClass("show-log-panel");
+          $("").removeClass("show-log-panel");
         }
       });

[Survived] StringLiteral
src/pages/Auth.jsx:33:40
 
           $(".white-panel").addClass("right-log");
           $(".register-show").addClass("show-log-panel");
-          $(".login-show").removeClass("show-log-panel");
+          $(".login-show").removeClass("");
         }
       });
