[Survived] BlockStatement
src/classes/PromiseQueue.js:3:26
 import Queue from './Queue.js'
 class PromiseQueue extends Queue {
-  constructor(delay = 0) {
-    super();
-    this.delay = delay;
-    this.currentPromise = null;
-  }
+  constructor(delay = 0) {}
 
   enqueuePromise(promise) {

[Survived] BlockStatement
src/classes/PromiseQueue.js:9:27
     this.currentPromise = null;
   }
 
-  enqueuePromise(promise) {
-    const wrappedPromise = () => new Promise(resolve => {
-      promise.then(result => {
-        resolve(result);
-        if (this.currentPromise === wrappedPromise) {
-          this.currentPromise = null;
-          this.resolveNextPromise();
-        }
-      });
-    });
-    this.enqueue(wrappedPromise);
-    this.resolveNextPromise();
-  }
+  enqueuePromise(promise) {}
 
   resolveNextPromise() {

[Survived] BlockStatement
src/classes/PromiseQueue.js:10:57
   }
 
   enqueuePromise(promise) {
-    const wrappedPromise = () => new Promise(resolve => {
-      promise.then(result => {
-        resolve(result);
-        if (this.currentPromise === wrappedPromise) {
-          this.currentPromise = null;
-          this.resolveNextPromise();
-        }
-      });
-    });
+    const wrappedPromise = () => new Promise(resolve => {});
     this.enqueue(wrappedPromise);
     this.resolveNextPromise();

[Survived] ArrowFunction
src/classes/PromiseQueue.js:10:28
   }
 
   enqueuePromise(promise) {
-    const wrappedPromise = () => new Promise(resolve => {
-      promise.then(result => {
-        resolve(result);
-        if (this.currentPromise === wrappedPromise) {
-          this.currentPromise = null;
-          this.resolveNextPromise();
-        }
-      });
-    });
+    const wrappedPromise = () => undefined;
     this.enqueue(wrappedPromise);
     this.resolveNextPromise();

[Survived] BlockStatement
src/classes/PromiseQueue.js:11:30
 
   enqueuePromise(promise) {
     const wrappedPromise = () => new Promise(resolve => {
-      promise.then(result => {
-        resolve(result);
-        if (this.currentPromise === wrappedPromise) {
-          this.currentPromise = null;
-          this.resolveNextPromise();
-        }
-      });
+      promise.then(result => {});
     });
     this.enqueue(wrappedPromise);

[Survived] EqualityOperator
src/classes/PromiseQueue.js:13:13
     const wrappedPromise = () => new Promise(resolve => {
       promise.then(result => {
         resolve(result);
-        if (this.currentPromise === wrappedPromise) {
+        if (this.currentPromise !== wrappedPromise) {
           this.currentPromise = null;
           this.resolveNextPromise();

[Survived] ConditionalExpression
src/classes/PromiseQueue.js:13:13
     const wrappedPromise = () => new Promise(resolve => {
       promise.then(result => {
         resolve(result);
-        if (this.currentPromise === wrappedPromise) {
+        if (false) {
           this.currentPromise = null;
           this.resolveNextPromise();

[Survived] BlockStatement
src/classes/PromiseQueue.js:23:24
     this.resolveNextPromise();
   }
 
-  resolveNextPromise() {
-    if (this.currentPromise || this.isEmpty()) {
-      return;
-    }
-    const promise = this.dequeue();
-    this.currentPromise = promise;
-    promise().then(() => {
-      setTimeout(() => {
-        if (this.currentPromise === promise) {
-          this.currentPromise = null;
-          this.resolveNextPromise();
-        }
-      }, this.delay);
-    });
-  }
+  resolveNextPromise() {}
 }
 

[Survived] ConditionalExpression
src/classes/PromiseQueue.js:24:9
   }
 
   resolveNextPromise() {
-    if (this.currentPromise || this.isEmpty()) {
+    if (false) {
       return;
     }

[Survived] ConditionalExpression
src/classes/PromiseQueue.js:24:9
   }
 
   resolveNextPromise() {
-    if (this.currentPromise || this.isEmpty()) {
+    if (true) {
       return;
     }

[Survived] BlockStatement
src/classes/PromiseQueue.js:29:26
     }
     const promise = this.dequeue();
     this.currentPromise = promise;
-    promise().then(() => {
-      setTimeout(() => {
-        if (this.currentPromise === promise) {
-          this.currentPromise = null;
-          this.resolveNextPromise();
-        }
-      }, this.delay);
-    });
+    promise().then(() => {});
   }
 }

[Survived] BlockStatement
src/classes/PromiseQueue.js:30:24
     const promise = this.dequeue();
     this.currentPromise = promise;
     promise().then(() => {
-      setTimeout(() => {
-        if (this.currentPromise === promise) {
-          this.currentPromise = null;
-          this.resolveNextPromise();
-        }
-      }, this.delay);
+      setTimeout(() => {}, this.delay);
     });
   }

[Survived] BlockStatement
src/classes/PromiseQueue.js:31:46
     this.currentPromise = promise;
     promise().then(() => {
       setTimeout(() => {
-        if (this.currentPromise === promise) {
-          this.currentPromise = null;
-          this.resolveNextPromise();
-        }
+        if (this.currentPromise === promise) {}
       }, this.delay);
     });

[Survived] EqualityOperator
src/classes/PromiseQueue.js:31:13
     this.currentPromise = promise;
     promise().then(() => {
       setTimeout(() => {
-        if (this.currentPromise === promise) {
+        if (this.currentPromise !== promise) {
           this.currentPromise = null;
           this.resolveNextPromise();
