[Survived] BlockStatement
src/App.js:11:16
 import "./App.css";
 import React, { Component } from "react";
 
-function App() {
-  return (
-    <div className="App">
-      <Router>
-        {" "}
-        <Routes>
-          <Route path="/" element={<Home />} />
-          <Route path="/profile" element={<Profile />} />
-          <Route path="/register" element={<Register />} />
-          <Route path="/contact" element={<Contact />} />
-
-          <Route path="/auth" element={<Auth />} />
-        </Routes>
-      </Router>
-    </div>
-  );
-}
+function App() {}
 
 export default App;

[Survived] StringLiteral
src/App.js:15:10
   return (
     <div className="App">
       <Router>
-        {" "}
+        {""}
         <Routes>
           <Route path="/" element={<Home />} />
