[Killed] BlockStatement
src/classes/Queue.js:2:17
 export default class Queue {
-  constructor() {
-    this.items = [];
-  }
+  constructor() {}
 
   enqueue(item) {
killedBy: Q1
statusReason: TypeError: Cannot read properties of undefined (reading 'push')

[Killed] ArrayDeclaration
src/classes/Queue.js:3:18
 export default class Queue {
   constructor() {
-    this.items = [];
+    this.items = ["Stryker was here"];
   }
 
killedBy: Q1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: "Stryker was here"

[Killed] BlockStatement
src/classes/Queue.js:6:17
     this.items = [];
   }
 
-  enqueue(item) {
-    this.items.push(item);
-  }
+  enqueue(item) {}
 
   dequeue() {
killedBy: Q1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: null

[Killed] BlockStatement
src/classes/Queue.js:10:13
     this.items.push(item);
   }
 
-  dequeue() {
-    if (this.isEmpty()) {
-      return null;
-    }
-    return this.items.shift();
-  }
+  dequeue() {}
 
   peek() {
killedBy: Q1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: undefined

[Killed] ConditionalExpression
src/classes/Queue.js:11:9
   }
 
   dequeue() {
-    if (this.isEmpty()) {
+    if (true) {
       return null;
     }
killedBy: Q1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: null

[Killed] ConditionalExpression
src/classes/Queue.js:11:9
   }
 
   dequeue() {
-    if (this.isEmpty()) {
+    if (false) {
       return null;
     }
killedBy: Q2
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: null
Received: undefined

[Killed] BlockStatement
src/classes/Queue.js:17:10
     return this.items.shift();
   }
 
-  peek() {
-    if (this.isEmpty()) {
-      return null;
-    }
-    return this.items[0];
-  }
+  peek() {}
 
   isEmpty() {
killedBy: Q1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: undefined

[Killed] ConditionalExpression
src/classes/Queue.js:18:9
   }
 
   peek() {
-    if (this.isEmpty()) {
+    if (true) {
       return null;
     }
killedBy: Q1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: null

[Survived] ConditionalExpression
src/classes/Queue.js:18:9
   }
 
   peek() {
-    if (this.isEmpty()) {
+    if (false) {
       return null;
     }

[Killed] BlockStatement
src/classes/Queue.js:24:13
     return this.items[0];
   }
 
-  isEmpty() {
-    return this.items.length === 0;
-  }
+  isEmpty() {}
 
   size() {
killedBy: Q2
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: null
Received: undefined

[Killed] EqualityOperator
src/classes/Queue.js:25:12
   }
 
   isEmpty() {
-    return this.items.length === 0;
+    return this.items.length !== 0;
   }
 
killedBy: Q1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: null

[Killed] ConditionalExpression
src/classes/Queue.js:25:12
   }
 
   isEmpty() {
-    return this.items.length === 0;
+    return true;
   }
 
killedBy: Q1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: null

[Survived] BlockStatement
src/classes/Queue.js:28:10
     return this.items.length === 0;
   }
 
-  size() {
-    return this.items.length;
-  }
+  size() {}
 }
 
