[Survived] BlockStatement
src/components/ContactUs.jsx:5:22
 import emailjs from "@emailjs/browser";
 import { useState } from "react";
 import "./styles/styles.css";
-const Result = () => {
-  return <p>Your message has been succesfully sent</p>;
-};
+const Result = () => {};
 function ContactUs(props) {
   const [result, showResult] = useState(false);

[Survived] BooleanLiteral
src/components/ContactUs.jsx:9:41
   return <p>Your message has been succesfully sent</p>;
 };
 function ContactUs(props) {
-  const [result, showResult] = useState(false);
+  const [result, showResult] = useState(true);
   const sendEmail = (e) => {
     e.preventDefault();

[Survived] BlockStatement
src/components/ContactUs.jsx:10:28
 };
 function ContactUs(props) {
   const [result, showResult] = useState(false);
-  const sendEmail = (e) => {
-    e.preventDefault();
-
-    emailjs
-      .sendForm(
-        "service_2g975pc",
-        "template_k9przkd",
-        e.target,
-        "aT5wsNnGkgvuLyMzO"
-      )
-      .then(
-        (result) => {
-          console.log(result.text);
-        },
-        (error) => {
-          console.log(error.text);
-        }
-      );
-    e.target.reset();
-    showResult(true);
-  };
+  const sendEmail = (e) => {};
   setTimeout(() => {
     showResult(false);

[Survived] BlockStatement
src/components/ContactUs.jsx:21:21
         "aT5wsNnGkgvuLyMzO"
       )
       .then(
-        (result) => {
-          console.log(result.text);
-        },
+        (result) => {},
         (error) => {
           console.log(error.text);

[Survived] BlockStatement
src/components/ContactUs.jsx:24:20
         (result) => {
           console.log(result.text);
         },
-        (error) => {
-          console.log(error.text);
-        }
+        (error) => {}
       );
     e.target.reset();

[Survived] BooleanLiteral
src/components/ContactUs.jsx:29:16
         }
       );
     e.target.reset();
-    showResult(true);
+    showResult(false);
   };
   setTimeout(() => {

[Survived] BlockStatement
src/components/ContactUs.jsx:31:20
     e.target.reset();
     showResult(true);
   };
-  setTimeout(() => {
-    showResult(false);
-  }, 5000);
+  setTimeout(() => {}, 5000);
   return (
     <div className="contact-us">

[Survived] BooleanLiteral
src/components/ContactUs.jsx:32:16
     showResult(true);
   };
   setTimeout(() => {
-    showResult(false);
+    showResult(true);
   }, 5000);
   return (
