[Survived] StringLiteral
src/components/Filters.jsx:8:5
   // Dummy restriction names
   const restriction_names = [
     "Halal",
-    "Lactose Intolerant",
+    "",
     "Nut Allergy",
     "Vegan",

[Survived] StringLiteral
src/components/Filters.jsx:10:5
     "Halal",
     "Lactose Intolerant",
     "Nut Allergy",
-    "Vegan",
+    "",
     "Vegetarian",
   ];

[Survived] StringLiteral
src/components/Filters.jsx:11:5
     "Lactose Intolerant",
     "Nut Allergy",
     "Vegan",
-    "Vegetarian",
+    "",
   ];
   const filters = restriction_names.map((name) => {

[Survived] BlockStatement
src/components/Filters.jsx:13:51
     "Vegan",
     "Vegetarian",
   ];
-  const filters = restriction_names.map((name) => {
-    return <Filter name={name} />;
-  });
+  const filters = restriction_names.map((name) => {});
 
   return (
