[Survived] StringLiteral
src/components/Footer.jsx:24:25
           <p>
             If you have any recommendations, ideas,or would like to add any
             dietary restriction not available in the selection, feel free to
-            contact us!{" "}
+            contact us!{""}
           </p>
           <ContactUs />
