[Survived] ObjectLiteral
src/components/Map.js:15:16
 
 //18.229781, -66.390552
 
-const center = {
-  lat:  18.229781,
-  lng: -66.390552,
-};
+const center = {};
 
 // async function fetchWithTimeoutAndDelay(resource, options = {}) {

[Survived] UnaryOperator
src/components/Map.js:17:8
 
 const center = {
   lat:  18.229781,
-  lng: -66.390552,
+  lng: +66.390552,
 };
 

[Survived] BlockStatement
src/components/Map.js:50:19
   try {
     let result = (await fetch(apiURL)).json()
     return result;
-  } catch (error) {
-    console.error(error);
-  }
+  } catch (error) {}
 }
 

[Survived] StringLiteral
src/components/Map.js:86:15
 async function getTown(coordinates) {
   const longitude = coordinates[0];
   const latitude = coordinates[1];
-  const url = `https://api.mapbox.com/geocoding/v5/mapbox.places/${longitude},${latitude}.json?access_token=${key}`;
+  const url = ``;
   const response = await fetch(url);
   
