[Survived] BlockStatement
src/components/Places.jsx:5:19
 import axios from 'axios';
 import {google} from 'googleapis'
 
-function Places() {
-    const [places, setPlaces] = useState([]);
-
-    useEffect(() =>{
-        const fetchPlaces = async () => {
-            const res = await axios.get('api/places', {
-                params: {
-                    latitude: 18.266,
-                    longitude: -66.406
-                }
-            })
-        }
-    })
-}
+function Places() {}

[Survived] BlockStatement
src/components/Places.jsx:8:20
 function Places() {
     const [places, setPlaces] = useState([]);
 
-    useEffect(() =>{
-        const fetchPlaces = async () => {
-            const res = await axios.get('api/places', {
-                params: {
-                    latitude: 18.266,
-                    longitude: -66.406
-                }
-            })
-        }
-    })
+    useEffect(() =>{})
 }

[Survived] BlockStatement
src/components/Places.jsx:9:41
     const [places, setPlaces] = useState([]);
 
     useEffect(() =>{
-        const fetchPlaces = async () => {
-            const res = await axios.get('api/places', {
-                params: {
-                    latitude: 18.266,
-                    longitude: -66.406
-                }
-            })
-        }
+        const fetchPlaces = async () => {}
     })
 }

[Survived] ObjectLiteral
src/components/Places.jsx:11:25
     useEffect(() =>{
         const fetchPlaces = async () => {
             const res = await axios.get('api/places', {
-                params: {
-                    latitude: 18.266,
-                    longitude: -66.406
-                }
+                params: {}
             })
         }

[Survived] UnaryOperator
src/components/Places.jsx:13:32
             const res = await axios.get('api/places', {
                 params: {
                     latitude: 18.266,
-                    longitude: -66.406
+                    longitude: +66.406
                 }
             })
