[Survived] StringLiteral
src/index.js:6:58
 import "./index.css";
 import App from "./App.js";
 
-const root = ReactDOM.createRoot(document.getElementById("root"));
+const root = ReactDOM.createRoot(document.getElementById(""));
 root.render(
   <React.StrictMode>
