[Survived] StringLiteral
src/node/populateDB.js:8:45
 import path from 'path';
 import * as url from 'url';
 import Restaurant from '../../dbSchemas/restaurantSchema.js'
-const __dirname = url.fileURLToPath(new URL('.', import.meta.url));
+const __dirname = url.fileURLToPath(new URL("", import.meta.url));
 
 

[Survived] ObjectLiteral
src/node/populateDB.js:13:15
 
 const envPath = path.join(__dirname, '../../.env');
 
-dotenv.config({ path: envPath })
+dotenv.config({})
 const key = process.env.REACT_APP_GOOGLE_MAPS_API_KEY;
 

[Survived] ArrayDeclaration
src/node/populateDB.js:18:18
 
 
 async function getPlacesByID(sliceStart, client, allIDs) {
-    let places = [];
+    let places = ["Stryker was here"];
     try {
         // Getting 50 IDs into an array

[Survived] ArithmeticOperator
src/node/populateDB.js:21:50
     let places = [];
     try {
         // Getting 50 IDs into an array
-        const sliceEnd = Math.min(allIDs.length, sliceStart + 50);
+        const sliceEnd = Math.min(allIDs.length, sliceStart - 50);
         const IDs = allIDs.slice(sliceStart, sliceEnd);
 

[Survived] MethodExpression
src/node/populateDB.js:22:21
     try {
         // Getting 50 IDs into an array
         const sliceEnd = Math.min(allIDs.length, sliceStart + 50);
-        const IDs = allIDs.slice(sliceStart, sliceEnd);
+        const IDs = allIDs;
 
         // Hold our promises to resolve later

[Survived] ObjectLiteral
src/node/populateDB.js:29:25
 
         IDs.forEach(ID => {
             const promise = client.placeDetails({
-                params: {
-                    place_id: ID,
-                    key
-                }
+                params: {}
             })
             .then(res => {

[Survived] BlockStatement
src/node/populateDB.js:34:26
                     key
                 }
             })
-            .then(res => {
-                const place = res.data.result;
-                const location = {
-                    type: 'Point',
-                    coordinates: [
-                        place.geometry.location.lng, 
-                        place.geometry.location.lat
-                    ]
-                }
-                const restaurant = {
-                    name: place.name,
-                    apiToken: place.place_id,
-                    location
-                }
-                places.push(restaurant);
-            })
+            .then(res => {})
             .catch(err => console.error(err));
             promises.push(promise);

[Survived] ObjectLiteral
src/node/populateDB.js:36:34
             })
             .then(res => {
                 const place = res.data.result;
-                const location = {
-                    type: 'Point',
-                    coordinates: [
-                        place.geometry.location.lng, 
-                        place.geometry.location.lat
-                    ]
-                }
+                const location = {}
                 const restaurant = {
                     name: place.name,

[Survived] ArrowFunction
src/node/populateDB.js:50:20
                 }
                 places.push(restaurant);
             })
-            .catch(err => console.error(err));
+            .catch(() => undefined);
             promises.push(promise);
         });

[Survived] BlockStatement
src/node/populateDB.js:55:21
         });
 
         await Promise.all(promises)
-        .then(() => {
-            console.log(`Processed ${places.length} places`);
-          })
+        .then(() => {})
           .catch((err) => {
             console.error(`Error processing promises: ${err}`);

[Survived] BlockStatement
src/node/populateDB.js:58:27
         .then(() => {
             console.log(`Processed ${places.length} places`);
           })
-          .catch((err) => {
-            console.error(`Error processing promises: ${err}`);
-          });
+          .catch((err) => {});
 
 

[Survived] BlockStatement
src/node/populateDB.js:63:41
           });
 
 
-        if (sliceEnd !== allIDs.length) {
-            const nextPlaces = await callGetPlacesDelay(sliceEnd, client, allIDs);
-            places = places.concat(nextPlaces);
-        }
+        if (sliceEnd !== allIDs.length) {}
         return places;
 

[Survived] ConditionalExpression
src/node/populateDB.js:63:13
           });
 
 
-        if (sliceEnd !== allIDs.length) {
+        if (false) {
             const nextPlaces = await callGetPlacesDelay(sliceEnd, client, allIDs);
             places = places.concat(nextPlaces);

[Survived] BlockStatement
src/node/populateDB.js:69:19
         }
         return places;
 
-    } catch (err) {
-        console.error(`Error parsing JSON data from file: ${filename}`);
-        console.error(err);
-    }
+    } catch (err) {}
 }
 

[Survived] BlockStatement
src/node/populateDB.js:75:63
     }
 }
 
-async function callGetPlacesDelay(sliceStart, client, allIDs) {
-    return new Promise(function (resolve, reject) {
-        setTimeout(async function () {
-        resolve(await getPlacesByID(sliceStart, client, allIDs));
-        }, 50);
-    });
-}
+async function callGetPlacesDelay(sliceStart, client, allIDs) {}
 
 async function main() {

[Survived] BlockStatement
src/node/populateDB.js:76:51
 }
 
 async function callGetPlacesDelay(sliceStart, client, allIDs) {
-    return new Promise(function (resolve, reject) {
-        setTimeout(async function () {
-        resolve(await getPlacesByID(sliceStart, client, allIDs));
-        }, 50);
-    });
+    return new Promise(function (resolve, reject) {});
 }
 

[Survived] BlockStatement
src/node/populateDB.js:77:38
 
 async function callGetPlacesDelay(sliceStart, client, allIDs) {
     return new Promise(function (resolve, reject) {
-        setTimeout(async function () {
-        resolve(await getPlacesByID(sliceStart, client, allIDs));
-        }, 50);
+        setTimeout(async function () {}, 50);
     });
 }

[Survived] BooleanLiteral
src/node/populateDB.js:90:26
     await mongoose.connect(
         `mongodb+srv://${username}:${password}@cetpr.tcwjqvy.mongodb.net/?retryWrites=true&w=majority`, 
     {
-        useNewUrlParser: true,
+        useNewUrlParser: false,
         useUnifiedTopology: true
     }

[Survived] BooleanLiteral
src/node/populateDB.js:91:29
         `mongodb+srv://${username}:${password}@cetpr.tcwjqvy.mongodb.net/?retryWrites=true&w=majority`, 
     {
         useNewUrlParser: true,
-        useUnifiedTopology: true
+        useUnifiedTopology: false
     }
     );

[Survived] BlockStatement
src/node/populateDB.js:106:18
     const places = await getPlacesByID(0, client, allIDs);
 
     Restaurant.collection.drop()
-    .then(res => {
-        places.forEach(place => {
-            const doc = new Restaurant(place);
-            doc.save();
-        });
-    })
+    .then(res => {})
     .catch(err => console.error(err));
 

[Survived] BlockStatement
src/node/populateDB.js:107:33
 
     Restaurant.collection.drop()
     .then(res => {
-        places.forEach(place => {
-            const doc = new Restaurant(place);
-            doc.save();
-        });
+        places.forEach(place => {});
     })
     .catch(err => console.error(err));

[Survived] ArrowFunction
src/node/populateDB.js:117:14
     
 }
 
-main().catch(err => console.error(err))
+main().catch(() => undefined)
 
