[Killed] BlockStatement
src/node/restaurant.js:2:55
 class Restaurant {
-    constructor(name, latlon, restrictionFulfillment) {
-        this.name = name;
-        this.latlon = latlon;
-        this.restrictionFulfillment = restrictionFulfillment;
-    }
+    constructor(name, latlon, restrictionFulfillment) {}
 
     getName() {
killedBy: Dummy restaurant 1
statusReason: TypeError: Cannot read properties of undefined (reading 'Kosher')

[Survived] BlockStatement
src/node/restaurant.js:8:15
         this.restrictionFulfillment = restrictionFulfillment;
     }
 
-    getName() {
-        return this.name;
-    }
+    getName() {}
 
     getLatLon() {

[Survived] BlockStatement
src/node/restaurant.js:12:17
         return this.name;
     }
 
-    getLatLon() {
-        return this.latlon;
-    }
+    getLatLon() {}
 
     fulfills(restriction) {

[Killed] BlockStatement
src/node/restaurant.js:16:27
         return this.latlon;
     }
 
-    fulfills(restriction) {
-        return Boolean(this.restrictionFulfillment[restriction]);
-    }
+    fulfills(restriction) {}
 
     getAllFulfills() {
killedBy: Dummy restaurant 1
statusReason: Error: expect(received).toBeTruthy()

Received: undefined

[Killed] BlockStatement
src/node/restaurant.js:20:22
         return Boolean(this.restrictionFulfillment[restriction]);
     }
 
-    getAllFulfills() {
-        var arr = [];
-        for (const [key, value] of Object.entries(this.restrictionFulfillment)) {
-            if (this.restrictionFulfillment[key]) {
-                arr.push(key);
-            }
-        }
-        return arr;
-    }
+    getAllFulfills() {}
 };
 
killedBy: Dummy restaurant 1
statusReason: TypeError: Cannot read properties of undefined (reading 'sort')

[Killed] ArrayDeclaration
src/node/restaurant.js:21:19
     }
 
     getAllFulfills() {
-        var arr = [];
+        var arr = ["Stryker was here"];
         for (const [key, value] of Object.entries(this.restrictionFulfillment)) {
             if (this.restrictionFulfillment[key]) {
killedBy: Dummy restaurant 1
statusReason: Error: expect(received).toBeTruthy()

Received: false

[Killed] BlockStatement
src/node/restaurant.js:22:81
 
     getAllFulfills() {
         var arr = [];
-        for (const [key, value] of Object.entries(this.restrictionFulfillment)) {
-            if (this.restrictionFulfillment[key]) {
-                arr.push(key);
-            }
-        }
+        for (const [key, value] of Object.entries(this.restrictionFulfillment)) {}
         return arr;
     }
killedBy: Dummy restaurant 1
statusReason: Error: expect(received).toBeTruthy()

Received: false

[Killed] ConditionalExpression
src/node/restaurant.js:23:17
     getAllFulfills() {
         var arr = [];
         for (const [key, value] of Object.entries(this.restrictionFulfillment)) {
-            if (this.restrictionFulfillment[key]) {
+            if (true) {
                 arr.push(key);
             }
killedBy: Dummy restaurant 1
statusReason: Error: expect(received).toBeTruthy()

Received: false

[Killed] BlockStatement
src/node/restaurant.js:23:51
     getAllFulfills() {
         var arr = [];
         for (const [key, value] of Object.entries(this.restrictionFulfillment)) {
-            if (this.restrictionFulfillment[key]) {
-                arr.push(key);
-            }
+            if (this.restrictionFulfillment[key]) {}
         }
         return arr;
killedBy: Dummy restaurant 1
statusReason: Error: expect(received).toBeTruthy()

Received: false
