[Survived] StringLiteral
src/pages/Home.jsx:32:71
 
             <p className="answer">
               Can I Eat There? aims to help people be able to find local food
-              services that meet their different dietary preferences.{" "}
+              services that meet their different dietary preferences.{""}
             </p>
             <button type="button" className="btn btn-outline-secondary">
