[Survived] BlockStatement
src/pages/Register.jsx:5:17
 import axios from "axios";
 
 class Register extends Component {
-  constructor() {
-    super();
-    this.state = {
-      firstName: "",
-      email: "",
-      password: "",
-    };
-    this.changeFullName = this.changeFullName.bind(this);
-    this.changeEmail = this.changeEmail.bind(this);
-    this.changePassword = this.changePassword.bind(this);
-    this.onSubmit = this.onSubmit.bind(this);
-  }
+  constructor() {}
 
   changeFullName(event) {

[Survived] BlockStatement
src/pages/Register.jsx:18:25
     this.onSubmit = this.onSubmit.bind(this);
   }
 
-  changeFullName(event) {
-    this.setState({
-      fullName: event.target.value,
-    });
-  }
+  changeFullName(event) {}
   changeEmail(event) {
     this.setState({

[Survived] BlockStatement
src/pages/Register.jsx:23:22
       fullName: event.target.value,
     });
   }
-  changeEmail(event) {
-    this.setState({
-      email: event.target.value,
-    });
-  }
+  changeEmail(event) {}
   changePassword(event) {
     this.setState({

[Survived] BlockStatement
src/pages/Register.jsx:28:25
       email: event.target.value,
     });
   }
-  changePassword(event) {
-    this.setState({
-      password: event.target.value,
-    });
-  }
+  changePassword(event) {}
   onSubmit(event) {
     event.preventDefault();

[Survived] BlockStatement
src/pages/Register.jsx:33:19
       password: event.target.value,
     });
   }
-  onSubmit(event) {
-    event.preventDefault();
-    const registered = {
-      fullName: this.state.fullName,
-      email: this.state.email,
-      password: this.state.password,
-    };
-    axios
-      .post("http://localhost:4000/api/signup ", registered)
-      .then((response) => console.log(response.data));
-    window.location = "/";
-  }
+  onSubmit(event) {}
 
   render() {

[Survived] ArrowFunction
src/pages/Register.jsx:42:13
     };
     axios
       .post("http://localhost:4000/api/signup ", registered)
-      .then((response) => console.log(response.data));
+      .then(() => undefined);
     window.location = "/";
   }
