[Killed] BlockStatement
src/util.js:1:41
-function arr_equal_no_order(arr1, arr2) {
-    return arr_equal(arr1.sort(), arr2.sort());
-}
+function arr_equal_no_order(arr1, arr2) {}
 function arr_equal(arr1, arr2) {
     if (arr1.length === arr2.length) {
killedBy: Dummy restaurant 1
statusReason: Error: expect(received).toBeTruthy()

Received: undefined

[Killed] MethodExpression
src/util.js:2:22
 function arr_equal_no_order(arr1, arr2) {
-    return arr_equal(arr1.sort(), arr2.sort());
+    return arr_equal(arr1, arr2.sort());
 }
 function arr_equal(arr1, arr2) {
killedBy: Dummy restaurant 3
statusReason: Error: expect(received).toBeTruthy()

Received: false

[Killed] MethodExpression
src/util.js:2:35
 function arr_equal_no_order(arr1, arr2) {
-    return arr_equal(arr1.sort(), arr2.sort());
+    return arr_equal(arr1.sort(), arr2);
 }
 function arr_equal(arr1, arr2) {
killedBy: Dummy restaurant 3
statusReason: Error: expect(received).toBeTruthy()

Received: false

[Killed] BlockStatement
src/util.js:4:32
 function arr_equal_no_order(arr1, arr2) {
     return arr_equal(arr1.sort(), arr2.sort());
 }
-function arr_equal(arr1, arr2) {
-    if (arr1.length === arr2.length) {
-        for (let i = 0; i < arr1.length; i++) {
-            if (arr1[i] !== arr2[i]) {
-                return false;
-            }
-        }
-    } else {
-        return false;
-    }
-    return true;
-}
+function arr_equal(arr1, arr2) {}
 
 export default {
killedBy: Dummy restaurant 1
statusReason: Error: expect(received).toBeTruthy()

Received: undefined

[Killed] ConditionalExpression
src/util.js:5:9
     return arr_equal(arr1.sort(), arr2.sort());
 }
 function arr_equal(arr1, arr2) {
-    if (arr1.length === arr2.length) {
+    if (false) {
         for (let i = 0; i < arr1.length; i++) {
             if (arr1[i] !== arr2[i]) {
killedBy: Dummy restaurant 1
statusReason: Error: expect(received).toBeTruthy()

Received: false

[Killed] EqualityOperator
src/util.js:5:9
     return arr_equal(arr1.sort(), arr2.sort());
 }
 function arr_equal(arr1, arr2) {
-    if (arr1.length === arr2.length) {
+    if (arr1.length !== arr2.length) {
         for (let i = 0; i < arr1.length; i++) {
             if (arr1[i] !== arr2[i]) {
killedBy: Dummy restaurant 1
statusReason: Error: expect(received).toBeTruthy()

Received: false

[Survived] BlockStatement
src/util.js:6:47
 }
 function arr_equal(arr1, arr2) {
     if (arr1.length === arr2.length) {
-        for (let i = 0; i < arr1.length; i++) {
-            if (arr1[i] !== arr2[i]) {
-                return false;
-            }
-        }
+        for (let i = 0; i < arr1.length; i++) {}
     } else {
         return false;

[Timeout] UpdateOperator
src/util.js:6:42
 }
 function arr_equal(arr1, arr2) {
     if (arr1.length === arr2.length) {
-        for (let i = 0; i < arr1.length; i++) {
+        for (let i = 0; i < arr1.length; i--) {
             if (arr1[i] !== arr2[i]) {
                 return false;

[Killed] ConditionalExpression
src/util.js:7:17
 function arr_equal(arr1, arr2) {
     if (arr1.length === arr2.length) {
         for (let i = 0; i < arr1.length; i++) {
-            if (arr1[i] !== arr2[i]) {
+            if (true) {
                 return false;
             }
killedBy: Dummy restaurant 1
statusReason: Error: expect(received).toBeTruthy()

Received: false

[Killed] EqualityOperator
src/util.js:7:17
 function arr_equal(arr1, arr2) {
     if (arr1.length === arr2.length) {
         for (let i = 0; i < arr1.length; i++) {
-            if (arr1[i] !== arr2[i]) {
+            if (arr1[i] === arr2[i]) {
                 return false;
             }
killedBy: Dummy restaurant 1
statusReason: Error: expect(received).toBeTruthy()

Received: false

[Survived] BooleanLiteral
src/util.js:8:24
     if (arr1.length === arr2.length) {
         for (let i = 0; i < arr1.length; i++) {
             if (arr1[i] !== arr2[i]) {
-                return false;
+                return true;
             }
         }

[Survived] BlockStatement
src/util.js:11:12
                 return false;
             }
         }
-    } else {
-        return false;
-    }
+    } else {}
     return true;
 }
