[Survived] BlockStatement
src/utils/search.ts:4:53
 type Latitude = number & { __latitudeBrand: true };
 type Longitude = number & {__longitudeBrand: true}
 
-function createLatitude(latitude: number): Latitude {
-  if (latitude < -180 || latitude > 180) {
-    throw new Error("Invalid latitude value. Must be between -180 and 180.");
-  }
-  return latitude as Latitude;
-}
+function createLatitude(latitude: number): Latitude {}
 
 function createLongitude(longitude: number): Longitude {

[Survived] BlockStatement
src/utils/search.ts:5:42
 type Longitude = number & {__longitudeBrand: true}
 
 function createLatitude(latitude: number): Latitude {
-  if (latitude < -180 || latitude > 180) {
-    throw new Error("Invalid latitude value. Must be between -180 and 180.");
-  }
+  if (latitude < -180 || latitude > 180) {}
   return latitude as Latitude;
 }

[Survived] ConditionalExpression
src/utils/search.ts:5:7
 type Longitude = number & {__longitudeBrand: true}
 
 function createLatitude(latitude: number): Latitude {
-  if (latitude < -180 || latitude > 180) {
+  if (false) {
     throw new Error("Invalid latitude value. Must be between -180 and 180.");
   }

[Survived] StringLiteral
src/utils/search.ts:6:21
 
 function createLatitude(latitude: number): Latitude {
   if (latitude < -180 || latitude > 180) {
-    throw new Error("Invalid latitude value. Must be between -180 and 180.");
+    throw new Error("");
   }
   return latitude as Latitude;

[Survived] BlockStatement
src/utils/search.ts:11:56
   return latitude as Latitude;
 }
 
-function createLongitude(longitude: number): Longitude {
-  if (longitude < -180 || longitude > 180) {
-    throw new Error("Invalid latitude value. Must be between -180 and 180.");
-  }
-  return longitude as Longitude;
-}
+function createLongitude(longitude: number): Longitude {}
 
 type Position = {

[Survived] EqualityOperator
src/utils/search.ts:12:27
 }
 
 function createLongitude(longitude: number): Longitude {
-  if (longitude < -180 || longitude > 180) {
+  if (longitude < -180 || longitude >= 180) {
     throw new Error("Invalid latitude value. Must be between -180 and 180.");
   }

[Survived] ConditionalExpression
src/utils/search.ts:12:7
 }
 
 function createLongitude(longitude: number): Longitude {
-  if (longitude < -180 || longitude > 180) {
+  if (true) {
     throw new Error("Invalid latitude value. Must be between -180 and 180.");
   }

[Survived] BlockStatement
src/utils/search.ts:23:66
   lon: Longitude;
 }
 
-function createPosition(lat: Latitude, lon: Longitude): Position {
-  return {
-    lat, lon
-  } as Position
-}
+function createPosition(lat: Latitude, lon: Longitude): Position {}
 
 type AccessToken = `pk.${string}.${string}`

[Survived] UnaryOperator
src/utils/search.ts:33:82
 type apiURL = `https://api.mapbox.com/v4/mapbox.mapbox-streets-v8/tilequery/${Longitude},${Latitude}.json?limit=50&layers=poi_label&radius=${number}&access_token=${AccessToken}`;
 
 //Create center object
-const center: Position = createPosition(createLatitude(28.1243), createLongitude(-81.5777));
+const center: Position = createPosition(createLatitude(28.1243), createLongitude(+81.5777));
 
 // Create apiURL string

[Survived] StringLiteral
src/utils/search.ts:36:26
 const center: Position = createPosition(createLatitude(28.1243), createLongitude(-81.5777));
 
 // Create apiURL string
-const key: AccessToken = "pk.eyJ1IjoiYWxvbnNvMTQiLCJhIjoiY2xmcm1scDM0MDVpMjN6bDhnenhleDI0dyJ9.WCGBtiA1Ij0EkiA6IpOgrA";
+const key: AccessToken = "";
 // Get Places helper function, returns a Promise
 async function getPlaces(lat: Latitude, lon: Longitude, radius: number): Promise<any> {

[Survived] BlockStatement
src/utils/search.ts:38:87
 // Create apiURL string
 const key: AccessToken = "pk.eyJ1IjoiYWxvbnNvMTQiLCJhIjoiY2xmcm1scDM0MDVpMjN6bDhnenhleDI0dyJ9.WCGBtiA1Ij0EkiA6IpOgrA";
 // Get Places helper function, returns a Promise
-async function getPlaces(lat: Latitude, lon: Longitude, radius: number): Promise<any> {
-  let url: apiURL =
-  `https://api.mapbox.com/v4/mapbox.mapbox-streets-v8/tilequery/${lon},${lat}.json?limit=50&layers=poi_label&radius=${radius}&access_token=${key}`;
-  try {
-    let result = (await fetch(url, {method: "GET"})).json();
-    return result;
-  } catch (error) {
-    console.error(error);
-    return null;
-  }
-}
+async function getPlaces(lat: Latitude, lon: Longitude, radius: number): Promise<any> {}
 
 

[Survived] StringLiteral
src/utils/search.ts:40:3
 // Get Places helper function, returns a Promise
 async function getPlaces(lat: Latitude, lon: Longitude, radius: number): Promise<any> {
   let url: apiURL =
-  `https://api.mapbox.com/v4/mapbox.mapbox-streets-v8/tilequery/${lon},${lat}.json?limit=50&layers=poi_label&radius=${radius}&access_token=${key}`;
+  ``;
   try {
     let result = (await fetch(url, {method: "GET"})).json();

[Survived] BlockStatement
src/utils/search.ts:41:7
 async function getPlaces(lat: Latitude, lon: Longitude, radius: number): Promise<any> {
   let url: apiURL =
   `https://api.mapbox.com/v4/mapbox.mapbox-streets-v8/tilequery/${lon},${lat}.json?limit=50&layers=poi_label&radius=${radius}&access_token=${key}`;
-  try {
-    let result = (await fetch(url, {method: "GET"})).json();
-    return result;
-  } catch (error) {
+  try {} catch (error) {
     console.error(error);
     return null;

[Survived] ObjectLiteral
src/utils/search.ts:42:36
   let url: apiURL =
   `https://api.mapbox.com/v4/mapbox.mapbox-streets-v8/tilequery/${lon},${lat}.json?limit=50&layers=poi_label&radius=${radius}&access_token=${key}`;
   try {
-    let result = (await fetch(url, {method: "GET"})).json();
+    let result = (await fetch(url, {})).json();
     return result;
   } catch (error) {

[Survived] BlockStatement
src/utils/search.ts:44:19
   try {
     let result = (await fetch(url, {method: "GET"})).json();
     return result;
-  } catch (error) {
-    console.error(error);
-    return null;
-  }
+  } catch (error) {}
 }
 

[Survived] BlockStatement
src/utils/search.ts:52:119
 
 
 // Updated searchPlaces function with more parameters
-async function searchPlaces(setPlaces: Function, width: number, xSegments: number, height: number, ySegments: number) {
-
-  for (let xoffset = -width; xoffset < width; xoffset += (width / xSegments) * 2) {
-    for (let yoffset = -height; yoffset < height; yoffset += (height / ySegments) * 2) {
-      let lat = createLatitude(center.lat + yoffset);
-      let lon = createLongitude(center.lon + xoffset);
-      let result = await getPlaces(lat, lon, 100);
-      console.log(result);
-      const placesDict: { [key: string]: string } = {};
-      for (let i = 0; i < result.features.length; i++) {
-        placesDict[result.features[i].place_id] = result.features[i].place_name;
-      }
-      setPlaces((prevPlaces: any) => ({ ...prevPlaces, ...placesDict }));
-    }
-  }
-}
+async function searchPlaces(setPlaces: Function, width: number, xSegments: number, height: number, ySegments: number) {}
 
 export {}

[Survived] EqualityOperator
src/utils/search.ts:54:30
 // Updated searchPlaces function with more parameters
 async function searchPlaces(setPlaces: Function, width: number, xSegments: number, height: number, ySegments: number) {
 
-  for (let xoffset = -width; xoffset < width; xoffset += (width / xSegments) * 2) {
+  for (let xoffset = -width; xoffset <= width; xoffset += (width / xSegments) * 2) {
     for (let yoffset = -height; yoffset < height; yoffset += (height / ySegments) * 2) {
       let lat = createLatitude(center.lat + yoffset);

[Survived] EqualityOperator
src/utils/search.ts:54:30
 // Updated searchPlaces function with more parameters
 async function searchPlaces(setPlaces: Function, width: number, xSegments: number, height: number, ySegments: number) {
 
-  for (let xoffset = -width; xoffset < width; xoffset += (width / xSegments) * 2) {
+  for (let xoffset = -width; xoffset >= width; xoffset += (width / xSegments) * 2) {
     for (let yoffset = -height; yoffset < height; yoffset += (height / ySegments) * 2) {
       let lat = createLatitude(center.lat + yoffset);

[Survived] EqualityOperator
src/utils/search.ts:55:33
 async function searchPlaces(setPlaces: Function, width: number, xSegments: number, height: number, ySegments: number) {
 
   for (let xoffset = -width; xoffset < width; xoffset += (width / xSegments) * 2) {
-    for (let yoffset = -height; yoffset < height; yoffset += (height / ySegments) * 2) {
+    for (let yoffset = -height; yoffset <= height; yoffset += (height / ySegments) * 2) {
       let lat = createLatitude(center.lat + yoffset);
       let lon = createLongitude(center.lon + xoffset);

[Survived] BlockStatement
src/utils/search.ts:55:88
 async function searchPlaces(setPlaces: Function, width: number, xSegments: number, height: number, ySegments: number) {
 
   for (let xoffset = -width; xoffset < width; xoffset += (width / xSegments) * 2) {
-    for (let yoffset = -height; yoffset < height; yoffset += (height / ySegments) * 2) {
-      let lat = createLatitude(center.lat + yoffset);
-      let lon = createLongitude(center.lon + xoffset);
-      let result = await getPlaces(lat, lon, 100);
-      console.log(result);
-      const placesDict: { [key: string]: string } = {};
-      for (let i = 0; i < result.features.length; i++) {
-        placesDict[result.features[i].place_id] = result.features[i].place_name;
-      }
-      setPlaces((prevPlaces: any) => ({ ...prevPlaces, ...placesDict }));
-    }
+    for (let yoffset = -height; yoffset < height; yoffset += (height / ySegments) * 2) {}
   }
 }

[Survived] ArithmeticOperator
src/utils/search.ts:56:32
 
   for (let xoffset = -width; xoffset < width; xoffset += (width / xSegments) * 2) {
     for (let yoffset = -height; yoffset < height; yoffset += (height / ySegments) * 2) {
-      let lat = createLatitude(center.lat + yoffset);
+      let lat = createLatitude(center.lat - yoffset);
       let lon = createLongitude(center.lon + xoffset);
       let result = await getPlaces(lat, lon, 100);

[Survived] ArithmeticOperator
src/utils/search.ts:57:33
   for (let xoffset = -width; xoffset < width; xoffset += (width / xSegments) * 2) {
     for (let yoffset = -height; yoffset < height; yoffset += (height / ySegments) * 2) {
       let lat = createLatitude(center.lat + yoffset);
-      let lon = createLongitude(center.lon + xoffset);
+      let lon = createLongitude(center.lon - xoffset);
       let result = await getPlaces(lat, lon, 100);
       console.log(result);

[Survived] UpdateOperator
src/utils/search.ts:61:51
       let result = await getPlaces(lat, lon, 100);
       console.log(result);
       const placesDict: { [key: string]: string } = {};
-      for (let i = 0; i < result.features.length; i++) {
+      for (let i = 0; i < result.features.length; i--) {
         placesDict[result.features[i].place_id] = result.features[i].place_name;
       }

[Survived] EqualityOperator
src/utils/search.ts:61:23
       let result = await getPlaces(lat, lon, 100);
       console.log(result);
       const placesDict: { [key: string]: string } = {};
-      for (let i = 0; i < result.features.length; i++) {
+      for (let i = 0; i <= result.features.length; i++) {
         placesDict[result.features[i].place_id] = result.features[i].place_name;
       }

[Survived] ArrowFunction
src/utils/search.ts:64:17
       for (let i = 0; i < result.features.length; i++) {
         placesDict[result.features[i].place_id] = result.features[i].place_name;
       }
-      setPlaces((prevPlaces: any) => ({ ...prevPlaces, ...placesDict }));
+      setPlaces(() => undefined);
     }
   }
